# IFCAggregate Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCAggregate Properties
IFCAggregate Class See Also
---
The IFCAggregate type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | The number of the data values in the aggregate. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Item | Get the IFCData for this aggregate. |

# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace